In [2]:
import numpy as np
import pandas as pd

In [30]:
import os
print(os.getcwd())
print(os.listdir())

/Users/shivani
['.config', 'Music', 'tf_env', 'mysql.ipynb', '.condarc', 'Recommendation.ipynb', 'StockData.ipynb', 'best_model.h5', '.DS_Store', 'Python2.ipynb', '.CFUserTextEncoding', '.xonshrc', 'anaconda_projects', 'Untitled.ipynb', '.zshrc', 'config.json', 'Pictures', '.zprofile', 'IdeaSnapshots', '.zsh_history', '.ipython', 'Desktop', 'Library', '.matplotlib', 'MedTech.ipynb', 'CTRL+HEAL.ipynb', 'aptos_resnet50_smote.h5', 'MedTech3.ipynb', 'DiabeticRetinopathy.ipynb', 'Public', '.idlerc', '.tcshrc', 'NumPy.ipynb', '.anaconda', 'Movies', 'model.h5', '.Trash', 'PBL-3_CSP351_Project Report_word.pages', 'connect_mysql.py', '.ipynb_checkpoints', '.jupyter', '.keras', 'MedTech2.ipynb', 'Documents', 'venv', '.pyenv', 'Python.ipynb', '.mysql_history', '.vscode', '.bash_profile', 'Pandas.ipynb', 'DiabeticRetinopathy-Copy1.ipynb', 'Downloads', '.redhat', '.continuum', '.cache', 'Titanic.ipynb', 'WeatherNotifier.ipynb', '.zsh_sessions', '.conda']

In [ ]:
data=pd.read_csv('StockData.csv')

In [20]:
data.head() #first 5 rows

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [24]:
data.tail() #last 5 rows

     stock        date  price
5031   ZTS  01-02-2018  77.82
5032   ZTS  02-02-2018  76.78
5033   ZTS  05-02-2018  73.83
5034   ZTS  06-02-2018  73.27
5035   ZTS  07-02-2018  73.86

In [22]:
data.sample(5) #random 5 rows

     stock        date  price
3891   ZTS  24-07-2013  29.90
4978   ZTS  14-11-2017  69.90
4264   ZTS  15-01-2015  42.94
4447   ZTS  07-10-2015  42.67
1727   SNI  17-12-2014  77.85

In [26]:
data.describe()

             price
count  5036.000000
mean     73.057030
std      29.011126
min      28.400000
25%      54.067500
50%      69.085000
75%      79.250000
max     179.260000

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5036 entries, 0 to 5035
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stock   5036 non-null   object
 1   date    5036 non-null   object
 2   price   5036 non-null   float64
dtypes: float64(1), object(2)
memory usage: 118.2+ KB

In [48]:
data.isnull().sum()

stock    0
date     0
price    0
dtype: int64

In [42]:
dataex = pd.read_excel('/Applications/University/year_2/Sem_4/DataScience/new.xlsx')
dataex.head()

  stock                 date    price
0  AAPL  2013-08-02 00:00:00  67.8542
1  AAPL  2013-11-02 00:00:00      NaN
2  AAPL  2013-12-02 00:00:00      NaN
3  AAPL           13-02-2013      NaN
4  AAPL           14-02-2013  66.6556

In [46]:
dataex.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5036 entries, 0 to 5035
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stock   5036 non-null   object
 1   date    5036 non-null   object
 2   price   5033 non-null   float64
dtypes: float64(1), object(2)
memory usage: 118.2+ KB

In [62]:
print(data.dtypes)
print(data.dtypes)

stock     object
date      object
price    float64
dtype: object
stock     object
date      object
price    float64
dtype: object

In [66]:
#check for duplicate 
data.duplicated().sum()

0

In [72]:
dataex.describe()

             price
count  5033.000000
mean     73.060418
std      29.019434
min      28.400000
25%      54.030000
50%      69.090000
75%      79.250000
max     179.260000

In [76]:
print(data.shape)
print(data.shape)

(5036, 3)
(5036, 3)

In [80]:
print(data['price'].min())
print(data['price'].max())

28.4
179.26

In [94]:
print(data[data['price']==data['price'].min()]) #to get record of min 
print(data[data['price']==data['price'].max()]) #t get record of max
#OR
min_index = data['price'].idxmin()
max_index = data['price'].idxmax()
min_row = data.loc[min_index]
max_row = data.loc[max_index]
print(min_row)
print(max_row)

     stock        date  price
4072   ZTS  11-04-2014   28.4
     stock        date   price
1244  AAPL  18-01-2018  179.26
stock           ZTS
date     11-04-2014
price          28.4
Name: 4072, dtype: object
stock          AAPL
date     18-01-2018
price        179.26
Name: 1244, dtype: object

In [103]:
#unique function
print(data['stock'].unique())
print(data['stock'].nunique())

['AAPL' 'SNI' 'TJX' 'ZTS']
4

In [105]:
#to get unique category count
data['stock'].value_counts()

stock
AAPL    1259
SNI     1259
TJX     1259
ZTS     1259
Name: count, dtype: int64

In [107]:
data['stock'].value_counts(normalize=True)

stock
AAPL    0.25
SNI     0.25
TJX     0.25
ZTS     0.25
Name: proportion, dtype: float64

normalisation why??
~to get rid of bias
~computational cost will reduce

In [114]:
#unique function
print(dataex['stock'].unique())
print(dataex['stock'].nunique())

['AAPL' '?' 'SNI' 'TJX' 'ZTS']
5

In [116]:
dataex['stock'].value_counts()

stock
SNI     1259
TJX     1259
ZTS     1259
AAPL    1258
?          1
Name: count, dtype: int64

In [118]:
dataex['stock'].value_counts(normalize=True)

stock
SNI     0.250000
TJX     0.250000
ZTS     0.250000
AAPL    0.249801
?       0.000199
Name: proportion, dtype: float64

In [120]:
dataex.isnull().sum()

stock    0
date     0
price    3
dtype: int64

In [128]:
print(dataex['price'].mean())
print(dataex['price'].median())
print(dataex['price'].mode())

73.0604175640771
69.09
0    74.59
Name: price, dtype: float64

In [130]:
dataex.describe()

             price
count  5033.000000
mean     73.060418
std      29.019434
min      28.400000
25%      54.030000
50%      69.090000
75%      79.250000
max     179.260000

In [136]:
#group by function
data.groupby(['stock'])['price'].sum()

stock
AAPL    137314.9734
SNI      89790.8800
TJX      84030.1500
ZTS      56779.1980
Name: price, dtype: float64

In [138]:
data.groupby(['stock'])['price'].mean()

stock
AAPL    109.066698
SNI      71.319206
TJX      66.743566
ZTS      45.098648
Name: price, dtype: float64

In [152]:
data.sort_values(by='price', ascending=False)

     stock        date   price
1244  AAPL  18-01-2018  179.26
1243  AAPL  17-01-2018  179.10
1245  AAPL  19-01-2018  178.46
1241  AAPL  12-01-2018  177.09
1247  AAPL  23-01-2018  177.04
...    ...         ...     ...
4076   ZTS  17-04-2014   28.60
4074   ZTS  15-04-2014   28.55
4075   ZTS  16-04-2014   28.53
4073   ZTS  14-04-2014   28.48
4072   ZTS  11-04-2014   28.40

[5036 rows x 3 columns]